minmos/terrasense/newFirmware/sdkconfig.defaults
# --- Target Chip ---
CONFIG_IDF_TARGET="esp32c6"

# --- Partition Table Settings ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Flash Storage ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- System Time Logging ---
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM=y

# --- OTA ---
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y